# 2️⃣ За довжинами трьох відрізків, які вводить користувач із клавіатури,
# визначити можливість існування трикутника, складеного з цих відрізків.
# Якщо такий трикутник існує, то визначити, чи є він різнобічним,
# рівнобедреним або рівностороннім

import math

a = int(input("Введіть довжину першої сторони "))
b = int(input("Введіть довжину другої сторони "))
c = int(input("Введіть довжину третьої сторони "))

# a + b > c
# a + c > b
# b + c > a

isTriangleExists = (a + b > c) and (a + c > b) and (b + c > a)

if isTriangleExists:
    # if 3 стороны одинаковые:
    if (a == b == c):
        print("Трикутник рівносторонній")
    #  a == b или a == c или a == ...
    elif (a == b) or (a == c) or (b == c):
        print("Трикутник рівнобедренний")
    else:
        print("Трикутник різнобічний")
else: 
    print("Трикутник не існує")
